app/controllers/references_controller.rb

SELECT  "references".* FROM "references" WHERE "references"."category" = ? LIMIT 1  [["category", "Initialize"]]
---
  def index
    @references_i = Reference.where(category: 'Initialize')

INSERT INTO "references" ("func", "usage_code", "usage_description", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @reference = Reference.new(reference_params)
    if @reference.save

UPDATE "references" SET "usage_description" = ?, "category" = ?, "updated_at" = ? WHERE "references"."id" = ?  [["usage_description", "WiringPi方式のピン番号を利用する場合に使用します。\r\nルート権限での実行が必要です。"], ["category", "Other"], ["updated_at", "2016-06-28 09:46:11.161617"], ["id", 1]]
---
  def update
    if @reference.update(reference_params)

DELETE FROM "references" WHERE "references"."id" = ?  [["id", 9]]
---
  def destroy
    @reference.destroy

SELECT  "references".* FROM "references" WHERE "references"."id" = ? LIMIT 1  [["id", nil]]
---
  def set_reference
    @reference = Reference.find(params[:id])